In [1]:
import pandas as pd

In [2]:
df1 = pd.read_excel('Data/mexico1.xlsx')
df2 = pd.read_excel('Data/mexico2.xlsx')
df3 = pd.read_excel('Data/mexico3.xlsx')

In [4]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 700 entries, 0 to 699
Data columns (total 6 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   property_type  700 non-null    object
 1   state          700 non-null    object
 2   lat            583 non-null    float64
 3   lon            583 non-null    float64
 4   area_m2        700 non-null    int64
 5   price_usd      700 non-null    float64
dtypes: float64(3), int64(1), object(2)
memory usage: 32.9+ KB

In [5]:
df1.head()

,property_type,state,lat,lon,area_m2,price_usd
0,house,Estado de México,19.560181,-99.233528,150,67965.56
1,house,Nuevo León,25.688436,-100.198807,186,63223.78
2,apartment,Guerrero,16.767704,-99.764383,82,84298.37
3,apartment,Guerrero,16.829782,-99.911012,150,94308.80
4,house,Veracruz de Ignacio de la Llave,NaN,NaN,175,94835.67

cleaning df1

In [6]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 700 entries, 0 to 699
Data columns (total 6 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   property_type  700 non-null    object
 1   state          700 non-null    object
 2   lat            583 non-null    float64
 3   lon            583 non-null    float64
 4   area_m2        700 non-null    int64
 5   price_usd      700 non-null    float64
dtypes: float64(3), int64(1), object(2)
memory usage: 32.9+ KB

In [8]:
#remove Nan- not a number
df1.dropna(inplace=True) #This changes the original dataframes
df1.info()

<class 'pandas.core.frame.DataFrame'>
Index: 583 entries, 0 to 699
Data columns (total 6 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   property_type  583 non-null    object
 1   state          583 non-null    object
 2   lat            583 non-null    float64
 3   lon            583 non-null    float64
 4   area_m2        583 non-null    int64
 5   price_usd      583 non-null    float64
dtypes: float64(3), int64(1), object(2)
memory usage: 31.9+ KB

In [9]:
df2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 700 entries, 0 to 699
Data columns (total 6 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   property_type  700 non-null    object
 1   state          700 non-null    object
 2   lat            571 non-null    float64
 3   lon            571 non-null    float64
 4   area_m2        700 non-null    int64
 5   price_mxn      700 non-null    int64
dtypes: float64(2), int64(2), object(2)
memory usage: 32.9+ KB

In [12]:
df2.head

  property_type             state        lat         lon  area_m2  price_mxn
0     apartment        Nuevo León  25.721081 -100.345581       72    1300000
2         house           Morelos  23.634501 -102.552788      360    5300000
6     apartment  Estado de México  19.272040  -99.572013       85    1250000
7         house   San Luis Potosí  22.138882 -100.996510      158    2120000
8     apartment  Distrito Federal  19.394558  -99.129707       65     758190

In [18]:
df2.dropna(inplace=True)
df2.head()

,property_type,state,lat,lon,area_m2,price_mxn,price_usd
0,apartment,Nuevo León,25.721081,-100.345581,72,1300000,68421.05
2,house,Morelos,23.634501,-102.552788,360,5300000,278947.37
6,apartment,Estado de México,19.272040,-99.572013,85,1250000,65789.47
7,house,San Luis Potosí,22.138882,-100.996510,158,2120000,111578.95
8,apartment,Distrito Federal,19.394558,-99.129707,65,758190,39904.74

In [16]:
#conversion of mexican pesos to usd 
#1 usd = 19 pesos
df2['price_usd'] = (df2['price_mxn'] / 19).round(2)
df2.head()

,property_type,state,lat,lon,area_m2,price_mxn,price_usd
0,apartment,Nuevo León,25.721081,-100.345581,72,1300000,68421.05
2,house,Morelos,23.634501,-102.552788,360,5300000,278947.37
6,apartment,Estado de México,19.272040,-99.572013,85,1250000,65789.47
7,house,San Luis Potosí,22.138882,-100.996510,158,2120000,111578.95
8,apartment,Distrito Federal,19.394558,-99.129707,65,758190,39904.74

In [24]:
#Dropping column (price_mxn)
#df2.drop(columns=["price_mxn"], inplace=True)
df2.head()

  property_type             state        lat         lon  area_m2  price_usd
0     apartment        Nuevo León  25.721081 -100.345581       72   68421.05
2         house           Morelos  23.634501 -102.552788      360  278947.37
6     apartment  Estado de México  19.272040  -99.572013       85   65789.47
7         house   San Luis Potosí  22.138882 -100.996510      158  111578.95
8     apartment  Distrito Federal  19.394558  -99.129707       65   39904.74

In [25]:
df3.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 700 entries, 0 to 699
Data columns (total 5 columns):
 #   Column                   Non-Null Count  Dtype
---  ------                   --------------  -----
 0   property_type            700 non-null    object
 1   place_with_parent_names  700 non-null    object
 2   lat-lon                  582 non-null    object
 3   area_m2                  700 non-null    int64
 4   price_usd                700 non-null    float64
dtypes: float64(1), int64(1), object(3)
memory usage: 27.5+ KB

In [26]:
df3.head()

,property_type,place_with_parent_names,lat-lon,area_m2,price_usd
0,apartment,|México|Distrito Federal|Gustavo A. Madero|Acu...,"19.52589,-99.151703",71,48550.59
1,house,|México|Estado de México|Toluca|Metepec|,"19.2640539,-99.5727534",233,168636.73
2,house,|México|Estado de México|Toluca|Toluca de Lerd...,"19.268629,-99.671722",300,86932.69
3,house,|México|Morelos|Temixco|Burgos Bugambilias|,NaN,275,263432.41
4,apartment,|México|Veracruz de Ignacio de la Llave|Veracruz|,"19.511938,-96.871956",84,68508.67

In [28]:
#removing Nan
df3.dropna(inplace=True)
df3.info()

<class 'pandas.core.frame.DataFrame'>
Index: 582 entries, 0 to 699
Data columns (total 5 columns):
 #   Column                   Non-Null Count  Dtype
---  ------                   --------------  -----
 0   property_type            582 non-null    object
 1   place_with_parent_names  582 non-null    object
 2   lat-lon                  582 non-null    object
 3   area_m2                  582 non-null    int64
 4   price_usd                582 non-null    float64
dtypes: float64(1), int64(1), object(3)
memory usage: 27.3+ KB

In [29]:
#splitting lat-lon column
df3['lat-lon'].head()

0       19.52589,-99.151703
1    19.2640539,-99.5727534
2      19.268629,-99.671722
4      19.511938,-96.871956
5     20.689157,-103.366728
Name: lat-lon, dtype: object

In [30]:
df3['lat-lon'].str.split(",").head()

0       [19.52589, -99.151703]
1    [19.2640539, -99.5727534]
2      [19.268629, -99.671722]
4      [19.511938, -96.871956]
5     [20.689157, -103.366728]
Name: lat-lon, dtype: object

In [31]:
df3['lat-lon'].str.split(",", expand=True).head() #creates new column for each

            0            1
0    19.52589   -99.151703
1  19.2640539  -99.5727534
2   19.268629   -99.671722
4   19.511938   -96.871956
5   20.689157  -103.366728

In [41]:
#df3[["lat", "lon"]] = df3['lat-lon'].str.split(",", expand=True)
df3.head()

,property_type,place_with_parent_names,area_m2,price_usd,lat,lon
0,apartment,|México|Distrito Federal|Gustavo A. Madero|Acu...,71,48550.59,19.52589,-99.151703
1,house,|México|Estado de México|Toluca|Metepec|,233,168636.73,19.2640539,-99.5727534
2,house,|México|Estado de México|Toluca|Toluca de Lerd...,300,86932.69,19.268629,-99.671722
4,apartment,|México|Veracruz de Ignacio de la Llave|Veracruz|,84,68508.67,19.511938,-96.871956
5,house,|México|Jalisco|Guadalajara|,175,102763.00,20.689157,-103.366728

In [37]:
#df3.drop(columns=['lat-lon'], inplace=True)
df3.head()

,property_type,place_with_parent_names,area_m2,price_usd,lat,lon
0,apartment,|México|Distrito Federal|Gustavo A. Madero|Acu...,71,48550.59,19.52589,-99.151703
1,house,|México|Estado de México|Toluca|Metepec|,233,168636.73,19.2640539,-99.5727534
2,house,|México|Estado de México|Toluca|Toluca de Lerd...,300,86932.69,19.268629,-99.671722
4,apartment,|México|Veracruz de Ignacio de la Llave|Veracruz|,84,68508.67,19.511938,-96.871956
5,house,|México|Jalisco|Guadalajara|,175,102763.00,20.689157,-103.366728

In [43]:
df3['lat'] = df3['lat'].astype(float)
df3['lon'] = df3['lon'].astype(float)

In [44]:
df3.info()

<class 'pandas.core.frame.DataFrame'>
Index: 582 entries, 0 to 699
Data columns (total 6 columns):
 #   Column                   Non-Null Count  Dtype
---  ------                   --------------  -----
 0   property_type            582 non-null    object
 1   place_with_parent_names  582 non-null    object
 2   area_m2                  582 non-null    int64
 3   price_usd                582 non-null    float64
 4   lat                      582 non-null    float64
 5   lon                      582 non-null    float64
dtypes: float64(3), int64(1), object(2)
memory usage: 31.8+ KB

In [49]:
df3['place_with_parent_names'].str.split("|", expand=True)[2]
df3['state'] = df3['place_with_parent_names'].str.split("|", expand=True)[2]
df3.head()

,property_type,place_with_parent_names,area_m2,price_usd,lat,lon,state
0,apartment,|México|Distrito Federal|Gustavo A. Madero|Acu...,71,48550.59,19.525890,-99.151703,Distrito Federal
1,house,|México|Estado de México|Toluca|Metepec|,233,168636.73,19.264054,-99.572753,Estado de México
2,house,|México|Estado de México|Toluca|Toluca de Lerd...,300,86932.69,19.268629,-99.671722,Estado de México
4,apartment,|México|Veracruz de Ignacio de la Llave|Veracruz|,84,68508.67,19.511938,-96.871956,Veracruz de Ignacio de la Llave
5,house,|México|Jalisco|Guadalajara|,175,102763.00,20.689157,-103.366728,Jalisco

In [50]:
df3.drop(columns=['place_with_parent_names'], inplace=True)

In [53]:
df3.info()

<class 'pandas.core.frame.DataFrame'>
Index: 582 entries, 0 to 699
Data columns (total 6 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   property_type  582 non-null    object
 1   area_m2        582 non-null    int64
 2   price_usd      582 non-null    float64
 3   lat            582 non-null    float64
 4   lon            582 non-null    float64
 5   state          582 non-null    object
dtypes: float64(3), int64(1), object(2)
memory usage: 31.8+ KB

concatinating dataframes

In [66]:
#concatinating horizontally axis=1
#concatinating vertically axis=0

In [68]:
df = pd.concat([df1,df2,df3])

In [69]:
df.shape

(1736, 6)

In [70]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 1736 entries, 0 to 699
Data columns (total 6 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   property_type  1736 non-null   object
 1   state          1736 non-null   object
 2   lat            1736 non-null   float64
 3   lon            1736 non-null   float64
 4   area_m2        1736 non-null   int64
 5   price_usd      1736 non-null   float64
dtypes: float64(3), int64(1), object(2)
memory usage: 94.9+ KB

In [72]:
df.to_csv('Data/mexicoDataSets.csv', index=False)